{"keras_version": "2.1.1", "config": [{"config": {"kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_1", "kernel_size": [5, 5], "kernel_constraint": null, "data_format": "channels_last", "trainable": true, "padding": "valid", "batch_input_shape": [null, 40, 40, 1], "use_bias": true, "dilation_rate": [1, 1], "bias_constraint": null, "strides": [1, 1], "filters": 128, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "dtype": "float32", "activation": "linear"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "activation_1", "activation": "relu"}, "class_name": "Activation"}, {"config": {"kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_2", "kernel_size": [5, 5], "kernel_constraint": null, "data_format": "channels_last", "trainable": true, "padding": "valid", "batch_input_shape": [null, 40, 40, 1], "use_bias": true, "dilation_rate": [1, 1], "bias_constraint": null, "strides": [1, 1], "filters": 32, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "dtype": "float32", "activation": "linear"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "activation_2", "activation": "relu"}, "class_name": "Activation"}, {"config": {"seed": null, "noise_shape": null, "trainable": true, "name": "dropout_1", "rate": 0.1}, "class_name": "Dropout"}, {"config": {"pool_size": [2, 2], "name": "max_pooling2d_1", "strides": [2, 2], "data_format": "channels_last", "trainable": true, "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_size": [4, 4], "kernel_constraint": null, "data_format": "channels_last", "trainable": true, "padding": "valid", "use_bias": true, "dilation_rate": [1, 1], "bias_constraint": null, "strides": [1, 1], "filters": 32, "name": "conv2d_3", "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "activation_3", "activation": "relu"}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "name": "max_pooling2d_2", "strides": [2, 2], "data_format": "channels_last", "trainable": true, "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"seed": null, "noise_shape": null, "trainable": true, "name": "dropout_2", "rate": 0.2}, "class_name": "Dropout"}, {"config": {"kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_size": [2, 2], "kernel_constraint": null, "data_format": "channels_last", "trainable": true, "padding": "valid", "use_bias": true, "dilation_rate": [1, 1], "bias_constraint": null, "strides": [1, 1], "filters": 16, "name": "conv2d_4", "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_1", "units": 512, "kernel_constraint": null, "trainable": true, "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear"}, "class_name": "Dense"}, {"config": {"kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_2", "units": 128, "kernel_constraint": null, "trainable": true, "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_4", "activation": "relu"}, "class_name": "Activation"}, {"config": {"kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_3", "units": 32, "kernel_constraint": null, "trainable": true, "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_5", "activation": "softmax"}, "class_name": "Activation"}], "class_name": "Sequential", "backend": "tensorflow"}