{"keras_version": "2.1.1", "config": [{"config": {"activation": "linear", "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_size": [5, 5], "batch_input_shape": [null, 40, 40, 1], "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "filters": 128, "trainable": true, "dtype": "float32", "padding": "valid", "kernel_constraint": null, "name": "conv2d_1", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "activation_1", "activation": "relu"}, "class_name": "Activation"}, {"config": {"activation": "linear", "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_size": [5, 5], "batch_input_shape": [null, 40, 40, 1], "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "filters": 32, "trainable": true, "dtype": "float32", "padding": "valid", "kernel_constraint": null, "name": "conv2d_2", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "activation_2", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "seed": null, "noise_shape": null, "rate": 0.1, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last", "trainable": true, "padding": "valid", "name": "max_pooling2d_1"}, "class_name": "MaxPooling2D"}, {"config": {"data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_size": [4, 4], "activation": "linear", "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "filters": 32, "trainable": true, "padding": "valid", "kernel_constraint": null, "name": "conv2d_3", "kernel_regularizer": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "activation_3", "activation": "relu"}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last", "trainable": true, "padding": "valid", "name": "max_pooling2d_2"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "seed": null, "noise_shape": null, "rate": 0.2, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_size": [2, 2], "activation": "linear", "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "filters": 16, "trainable": true, "padding": "valid", "kernel_constraint": null, "name": "conv2d_4", "kernel_regularizer": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "units": 512, "trainable": true, "kernel_constraint": null, "name": "dense_1", "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "units": 128, "trainable": true, "kernel_constraint": null, "name": "dense_2", "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_4", "activation": "relu"}, "class_name": "Activation"}, {"config": {"use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "units": 32, "trainable": true, "kernel_constraint": null, "name": "dense_3", "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_5", "activation": "softmax"}, "class_name": "Activation"}], "backend": "tensorflow", "class_name": "Sequential"}